In [1]:
from DemoServerDB import ConnectDatabase
from mapping import doc

In [2]:
temp = ConnectDatabase()

In [3]:
temp.conn

In [4]:
query = 'SELECT * FROM %s'%(doc['table_map']['EVENT_LOG'])

In [5]:
print query

SELECT * FROM event

In [6]:
temp.cur.execute(query)

In [7]:
col_names = [desc[0] for desc in temp.cur.description]

In [8]:
col_names

['from_id', 'to_id', 'actiontype', 'timestamp']

In [9]:
import pandas as pd

In [10]:
event_table = pd.DataFrame(temp.cur.fetchall(), columns=col_names)

In [11]:
event_table.head()

   from_id    to_id  actiontype            timestamp
0  5913757  2870883           4  2016-06-07 00:00:00
1  5364976  2870883           4  2016-06-07 00:00:05
2  5914063  2870883           4  2016-06-07 00:00:07
3   435397  3517227           7  2016-06-07 00:00:09
4  3517227   435397           7  2016-06-07 00:00:09

In [12]:
event_table.rename(columns={doc['column_map']['EVENT_LOG']['cust_id']:'cust_id'}, inplace=True)
event_table.rename(columns={doc['column_map']['EVENT_LOG']['product_id']:'product_id'}, inplace=True)
event_table.rename(columns={doc['column_map']['EVENT_LOG']['action_type']:'action_type'}, inplace=True)
event_table.rename(columns={doc['column_map']['EVENT_LOG']['timestamp']:'timestamp'}, inplace=True)

In [13]:
event_table.head()

   cust_id  product_id  action_type            timestamp
0  5913757     2870883            4  2016-06-07 00:00:00
1  5364976     2870883            4  2016-06-07 00:00:05
2  5914063     2870883            4  2016-06-07 00:00:07
3   435397     3517227            7  2016-06-07 00:00:09
4  3517227      435397            7  2016-06-07 00:00:09

In [14]:
event_table.shape

(49594589, 4)

In [15]:
event_df = event_table[['cust_id','product_id']]

In [16]:
grp_cust = event_df.groupby('cust_id').count()

In [17]:
grp_cust.head()

         product_id
cust_id
999               7
1009              1
1029             14
1037             35
1038             30

In [18]:
grp_cust = grp_cust.reset_index()

In [19]:
grp_cust.head()

   cust_id  product_id
0      999           7
1     1009           1
2     1029          14
3     1037          35
4     1038          30

In [20]:
grp_cust.rename(columns={'product_id':'count'}, inplace=True)

In [21]:
grp_cust.head()

   cust_id  count
0      999      7
1     1009      1
2     1029     14
3     1037     35
4     1038     30

In [22]:
grp_cust_df_1 = grp_cust.query('count != 1')

In [23]:
grp_cust_df_1.head()

   cust_id  count
0      999      7
2     1029     14
3     1037     35
4     1038     30
5     1042     45

In [24]:
grp_cust_df_1.shape

(127145, 2)

In [25]:
grp_cust.shape

(141439, 2)

In [26]:
grp_cust_df_1.reset_index(drop=True, inplace=True)

In [27]:
grp_cust_df_1.head()

   cust_id  count
0      999      7
1     1029     14
2     1037     35
3     1038     30
4     1042     45

In [28]:
grp_cust_df_1.tail()

        cust_id  count
127140  6168083    118
127141  6168099     71
127142  6168107     16
127143  6168117     23
127144  6168138     72

In [29]:
cust = grp_cust_df_1[['cust_id']]

In [30]:
cust.head()

   cust_id
0      999
1     1029
2     1037
3     1038
4     1042

In [31]:
final_data = event_df.merge(cust, on='cust_id')

In [32]:
cust_prod_comb = final_data.groupby(['cust_id','product_id']).size().reset_index().rename(columns={0:'count'})

In [33]:
cust_prod_comb.head()

   cust_id  product_id  count
0      999     4612913      1
1      999     5296663      1
2      999     5719127      1
3      999     5859083      1
4      999     5865893      1

In [34]:
affinity_df = cust_prod_comb.merge(grp_cust_df_1, on='cust_id')

In [35]:
affinity_df.head()

   cust_id  product_id  count_x  count_y
0      999     4612913        1        7
1      999     5296663        1        7
2      999     5719127        1        7
3      999     5859083        1        7
4      999     5865893        1        7

In [36]:
affinity_df.rename(columns={'count_x':'combination'}, inplace=True)
affinity_df.rename(columns={'count_y':'visits'}, inplace=True)

In [37]:
affinity_df.head()

   cust_id  product_id  combination  visits
0      999     4612913            1       7
1      999     5296663            1       7
2      999     5719127            1       7
3      999     5859083            1       7
4      999     5865893            1       7

In [38]:
affinity_df['affinity'] = affinity_df['combination'] / affinity_df['visits'] * 100

In [39]:
affinity_df.head()

   cust_id  product_id  combination  visits   affinity
0      999     4612913            1       7  14.285714
1      999     5296663            1       7  14.285714
2      999     5719127            1       7  14.285714
3      999     5859083            1       7  14.285714
4      999     5865893            1       7  14.285714

def class_type(row):
    if row['affinity'] >= 50 :
        return 'Class_A'
    if row['affinity'] >= 20 and row['affinity'] < 50 :
        return 'Class_B'
    if row['affinity'] < 20 :
        return 'Class_C'
    return 'Other'

affinity_df.apply (lambda row: class_type(row),axis=1)

grp_cust_df_1['Class'] = grp_cust_df_1.apply (lambda row: class_type (row),axis=1)

In [40]:
affinity_df['class'] = ""

In [41]:
affinity_df.head()

   cust_id  product_id  combination  visits   affinity class
0      999     4612913            1       7  14.285714
1      999     5296663            1       7  14.285714
2      999     5719127            1       7  14.285714
3      999     5859083            1       7  14.285714
4      999     5865893            1       7  14.285714

In [42]:
affinity_df.loc[affinity_df['affinity'] >= 50, 'class'] = "Class_A"

In [44]:
affinity_df.loc[(affinity_df['affinity'] >= 20) & (affinity_df['affinity'] < 50) , 'class'] = "Class_B"

In [46]:
affinity_df.loc[affinity_df['affinity'] < 20 , 'class'] = "Class_C"

In [47]:
affinity_df.head()

   cust_id  product_id  combination  visits   affinity    class
0      999     4612913            1       7  14.285714  Class_C
1      999     5296663            1       7  14.285714  Class_C
2      999     5719127            1       7  14.285714  Class_C
3      999     5859083            1       7  14.285714  Class_C
4      999     5865893            1       7  14.285714  Class_C